In [ ]:
#import pandas as pd
import pandas as pd 

#list of strings 
lyst = ['CSC','102','is','the','best','course','ever'] 

#Calling dataframe constructor on list 
df = pd.DataFrame(lyst) 

#print the output 
df

In [ ]:
import pandas as pd 

  #intialise data of lists 
data = {'Name':['Angela','Precious','Luis','Ade','Jasmine'],
        'Age': [20,21,19,18,20]} 

df = pd.DataFrame(data) 
#Print the output
df

In [ ]:
import pandas as pd 
#Define a dictionary containing employee data 

data = {'Name': ['Clem','Prince','Edward','Adele'], 
       'Age': [27, 24, 22, 32],
       'Address': ['Abuja','Kano','Minna','Lagos'],
       'Qualification': ['MSC','MA','MCA','Phd']} 

df = pd.DataFrame(data) 

df[['Name','Qualification']]

In [ ]:
import pandas as pd 

data = {'Name':['Oyin','Mary','David','Bola'],
       'Age':[27,24,22,32],
       'Address':['Asaba','Maiduguri','Onitsha','Kwara'],
       'Qualification':['Msc','MA','MCA','Phd']} 

df = pd.DataFrame(data) 

df.iloc[0]

In [2]:
import pandas as pd 

data = pd.read_csv("employee_records.csv") 

#print excel
data

    Employee Names  Years  Assesment Records  Points  Reward
0      Matthew Ade     25              125.3      21  438.55
1   Angela Adebisi     15               77.9      14  181.77
2  Calistus Ndukwe     10              144.2      18  432.60
3   Martha Martins      9               81.5      25  339.58
4    Victor Sayola     18               77.8      33  427.90
5      Adamu Bello     23               99.5      24  398.00

In [1]:
import pandas as pd 

data = pd.read_csv("employee_records.csv") 

df = data.head(1) 

df

  Employee Names  Years  Assesment Records  Points  Reward
0    Matthew Ade     25              125.3      21  438.55

In [4]:

import pandas as pd

dict = {'name':["Abdul","Chukwuemeka","seyi","Matt"], 
        'degree':["MBA","BCA","M.Tech","MBA"], 
        'score':[90,40,80,98]} 

df = pd.DataFrame(dict) 

for i,j in df.iterrows(): 
    print(i,j) 
    print()

0 name      Abdul
degree      MBA
score        90
Name: 0, dtype: object

1 name      Chukwuemeka
degree            BCA
score              40
Name: 1, dtype: object

2 name        seyi
degree    M.Tech
score         80
Name: 2, dtype: object

3 name      Matt
degree     MBA
score       98
Name: 3, dtype: object

In [6]:
import pandas as pd 

dict = {'name':["Bello","Kamara","Ugochi","David"],
        'degree':["MBA","BCA","M.Tech","MBA"], 
        'score':[90,40,80,98]} 

df = pd.DataFrame(dict) 

columns = list(df) 

for i in columns: 
        print(df[i][2])

Ugochi
M.Tech
80

In [9]:
import pandas as pd 

records = {'name':["Abel","Kamsi","Oyode","Chinelo"],
           'degree':["MBA","BCA","M.Tech","MBA"], 
          'score':[90,40,80,98]} 

df = pd.DataFrame(records)  

df.to_csv('record.csv')